export const MockData: MockDataType[] = [
  {
    id: 0,
    question: "هل تستطيع القطط السباحة؟",
    options: [
      "نعم، معظمها تستطيع",
      "لا، لا تستطيع",
      "البعض منها يستطيع",
      "لا، جميعها لا تستطيع",
    ],
    answer: 2,
  },
  {
    id: 1,
    question: "هل السماء زرقاء؟",
    options: [
      "نعم، دائما",
      "لا، ليست دائما",
      "أحيانا زرقاء",
      "ليست زرقاء أبدا",
    ],
    answer: 1,
  },
  {
    id: 2,
    question: "هل يمكن للبشر أن يطيروا بدون مساعدة؟",
    options: [
      "نعم، بالتأكيد",
      "لا، لا يمكن",
      "ربما في المستقبل",
      "نعم، لكن ليس لفترة طويلة",
    ],
    answer: 1,
  },
  {
    id: 3,
    question: "هل الأرض كروية؟",
    options: ["نعم، بالتأكيد", "لا، مسطحة", "هي بيضاوية", "هي غير منتظمة"],
    answer: 0,
  },
  {
    id: 4,
    question: "هل يمكننا العيش على المريخ؟",
    options: [
      "نعم، حاليا",
      "لا، لا يمكن",
      "ربما في المستقبل",
      "نعم، لكن بصعوبة",
    ],
    answer: 2,
  },
  {
    id: 5,
    question: "هل الماء ضروري للحياة؟",
    options: [
      "نعم، بكل تأكيد",
      "لا، ليس ضروري",
      "فقط لبعض الكائنات",
      "ليس دائما",
    ],
    answer: 0,
  },
]
